In [34]:
import pandas as pd

df = pd.DataFrame({'spa1':[1,2,3,4],
                   'spa2':[444,555,666,444],
                   'spa3':['abc','def','ghi','xyz']})

gibt ersten x Zeilen aus

In [5]:
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Unique values (row or column)

In [38]:
df.loc[2].unique()
#df['spa2'].unique()

array([3, 666, 'ghi'], dtype=object)

Number of unique values

In [10]:
df['spa1'].nunique()

4

Number of values

In [11]:
df['spa2'].value_counts()

444    2
555    1
666    1
Name: spa2, dtype: int64

In [14]:
newdf = df[(df['spa1']>2) & (df['spa2']==444)]

In [15]:
newdf

   spa1  spa2 spa3
3     4   444  xyz

In [16]:
def mal2 (x):
    return x*2

Apply the function to all values in df[]

In [17]:
df['spa1'].apply(mal2)

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [18]:
df

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df['spa3'].apply(len)

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

In [21]:
df['spa2'].apply(lambda x: x*3)

0    1332
1    1665
2    1998
3    1332
Name: spa2, dtype: int64

In [22]:
df.min()

spa1      1
spa2    444
spa3    abc
dtype: object

delete row or col not permanently

In [23]:
df.drop('spa1', axis=1)

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

Delete row or column from DataFrame permanently

In [ ]:
del df['spa1']

In [24]:
df.columns

Index(['spa1', 'spa2', 'spa3'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
df.sort_values(by='spa2', inplace=True)

In [28]:
df

   spa1  spa2 spa3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Pivot

In [39]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]
}

df = pd.DataFrame(data)

In [40]:
df.pivot_table(values='D', index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN